#
# Brew Taps (see formulae below)
#
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

#
# Libraries and Core-Utilities
#
brew "bash"                                         # https://www.gnu.org/software/bash/ Bourne-Again SHell, a UNIX command interpreter
brew "boost"                                        # https://www.boost.org/ Collection of portable C++ source libraries
brew "brew-cask-completion"                         # https://github.com/xyb/homebrew-cask-completion Fish/zsh completion for brew-cask
brew "cmake"                                        # https://www.cmake.org/ Cross-platform make
brew "fontconfig"                                   # https://wiki.freedesktop.org/www/Software/fontconfig/ XML-based font configuration API for X Windows
brew "libmagic"                                     # https://www.darwinsys.com/file/ Implementation of the file(1) command - required for python mime detection
brew "libsodium"                                    # https://github.com/jedisct1/libsodium/ A modern, portable, easy to use crypto library
brew "nghttp2"                                      # https://github.com/nghttp2/nghttp2 HTTP/2 C Library and tools
brew "openssh"                                      # https://www.openssh.com/ OpenBSD freely-licensed SSH connectivity tools
brew "openssl"                                      # https://openssl.org/ Cryptography and SSL/TLS Toolkit
brew "readline"                                     # ensure gawk and others... get up-to-date readline
brew "reattach-to-user-namespace"                   # https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard Notes and workarounds for accessing the Mac OS X pasteboard in tmux sessions
brew "screen"                                       # https://www.gnu.org/software/screen GNU Screen
brew "zsh"                                          # https://www.zsh.org/ UNIX shell (command interpreter)

#
# Compression
#
brew "brotli"                                       # https://github.com/google/brotli Generic-purpose lossless compression algorithm by Google
brew "lz4"                                          # https://lz4.org Lossless compression utility, similar to zip
brew "xz"                                           # https://tukaani.org/xz/ General-purpose data compression with high compression ratio
brew "zstd"                                         # https://facebook.github.io/zstd/ Zstandard is a real-time compression algorithm

#
# GNU or Similar
#
brew "coreutils"                                    # https://www.gnu.org/software/coreutils GNU File, Shell, and Text utilities
brew "findutils"                                    # https://www.gnu.org/software/findutils GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "gawk"                                         # GNU awk utility
brew "gnu-sed"                                      # GNU sed (replaces off-brand macos, e.g. "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file")
brew "gnupg"                                        # https://gnupg.org/ GNU Privacy Guard
brew "grep"                                         # GNU grep (replaces off-brand macos)
brew "moreutils"                                    # https://joeyh.name/code/moreutils/ Install some other useful utilities like `sponge`
brew "tree"                                         # http://mama.indstate.edu/users/ice/tree/ Display directories as trees (with optional color/HTML output)
brew "wget"                                         # https://www.gnu.org/software/wget/ GNU wget

#
# SDKs
#
brew "elixir"                                       # https://elixir-lang.org/ Functional metaprogramming aware language built on Erlang VM
brew "erlang"                                       # https://www.erlang.org/ Programming language for highly scalable real-time systems
brew "go"                                           # (Backup, primary managed by asdf) https://golang.org The GO Programming language
brew "python"                                       # (Backup, primary managed by asdf) https://www.python.org/ Latest python (>3.7)
brew "rust"                                         # https://www.rust-lang.org/ Safe, concurrent, practical language
brew "opentofu"                                     # https://opentofu.org/ Drop-in replacement for Terraform. Infrastructure as Code Tool

#
# Docker
#
brew "docker-credential-helper-ecr"                 # https://github.com/awslabs/amazon-ecr-credential-helper Docker Credential Helper for Amazon ECR
brew "kind"                                         # https://kind.sigs.k8s.io/ Run local Kubernetes cluster in Docker
brew "kubernetes-cli"                               # https://kubernetes.io/docs/reference/kubectl/ Kubernetes command-line interface
brew "kustomize"                                    # https://github.com/kubernetes-sigs/kustomize Template-free customization of Kubernetes YAML manifests

#
# CLIs
#
brew "awscli"                                       # https://aws.amazon.com/cli/ Official Amazon AWS command-line interface
brew "bat"                                          # https://github.com/sharkdp/bat Clone of cat(1) with syntax highlighting and Git integration
brew "bottom"                                       # https://clementtsang.github.io/bottom/ Yet another cross-platform graphical process/system monitor
brew "chezmoi"                                      # https://chezmoi.io/ Manage your dotfiles across multiple diverse machines, securely
brew "crane"                                        # https://github.com/google/go-containerregistry Tool for interacting with remote images and registries
brew "dive"                                         # https://github.com/wagoodman/dive Tool for exploring each layer in a docker image
brew "dos2unix"                                     # https://waterlan.home.xs4all.nl/dos2unix.html Convert text between DOS, UNIX, and Mac formats
brew "dust"                                         # https://github.com/bootandy/dust More intuitive version of du in rust
brew "ec2-instance-selector"                        # https://github.com/aws/amazon-ec2-instance-selector/ EC2 Instance Selector is a tool to filter EC2 instance types based on resource criteria
brew "ffmpeg"                                       # https://ffmpeg.org/ Play, record, convert, and stream audio and video
brew "fzf"                                          # https://github.com/junegunn/fzf A command-line fuzzy finder
brew "gh"                                           # https://cli.github.com/ GitHub command-line tool
brew "git"                                          # https://git-scm.com Distributed revision control system
brew "gum"                                          # https://github.com/charmbracelet/gum Tool for glamorous shell scripts
brew "htop"                                         # https://hisham.hm/htop/ Improved top
brew "imagemagick"                                  # https://imagemagick.org/index.php Tools and libraries to manipulate images in many formats
brew "jnv"                                          # https://github.com/ynqa/jnv Interactive JSON filter using jq
brew "jq"                                           # https://stedolan.github.io/jq/ Awesome JSON command line utility
brew "lsd"                                          # https://github.com/Peltoche/lsd The next gen ls command
brew "mas"                                          # https://github.com/mas-cli/mas Mac App Store command-line interface
brew "mise"                                         # https://mise.jdx.dev/ Polyglot runtime manager (asdf rust clone)
brew "ncdu"                                         # https://dev.yorhel.nl/ncdu NCurses Disk Usage
brew "nmap"                                         # https://nmap.org/ Port scanning utility for large networks
brew "nvim"                                         # https://neovim.io/ Ambitious Vim-fork focused on extensibility and agility
brew "ocr"                                          # https://github.com/schappim/macOCR Get any text on your screen into your clipboard.
brew "pgcli"                                        # https://pgcli.com/ CLI for Postgres with auto-completion and syntax highlighting
brew "potrace"                                      # (imagemagick plugin) https://potrace.sourceforge.net/ Convert bitmaps to vector graphics
brew "ripgrep"                                      # https://github.com/BurntSushi/ripgrep Search tool like grep and The Silver Searcher
brew "skate"                                        # https://github.com/charmbracelet/skate Personal key value store
brew "slides"                                       # https://github.com/maaslalani/slides Terminal based presentation tool
brew "starship"                                     # https://starship.rs Cross-shell prompt for astronauts
brew "tig"                                          # https://jonas.github.io/tig/ Text interface for Git repositories
brew "tldr"                                         # https://tldr.sh/ Simplified and community-driven man pages
brew "tmux"                                         # https://tmux.github.io/ Terminal multiplexer
brew "trash"                                        # https://hasseg.org/trash/ CLI tool that moves files or folder to the trash
brew "vegeta"                                       # https://github.com/tsenart/vegeta HTTP load testing tool and library
brew "vim"                                          # https://www.vim.org/ Up-to-date vim replacement
brew "watch"                                        # https://gitlab.com/procps-ng/procps Executes a program periodically, showing output fullscreen
brew "wireguard-tools"                              # https://www.wireguard.com/ Tools for the WireGuard secure network tunnel
brew "xh"                                           # https://github.com/ducaale/xh Modern cURL + features
brew "yazi"                                         # https://github.com/sxyazi/yazi Blazing fast terminal file manager written in Rust, based on async I/O
brew "yt-dlp"                                       # https://github.com/yt-dlp/yt-dlp Feature-rich command-line audio/video downloader

#
# Brew Casks
#
cask "aerial"                                       # https://github.com/JohnCoates/Aerial Pretty screen-savers
cask "aerospace"                                    # https://github.com/nikitabobko/AeroSpace AeroSpace is an i3-like tiling window manager for macOS
cask "alacritty"                                    # https://github.com/alacritty/alacritty/ GPU-accelerated terminal emulator
cask "bartender"                                    # Not free software https://www.macbartender.com/
cask "bitwarden"                                    # https://bitwarden.com/ The definitive best personal credential manager
cask "brave-browser"                                # https://brave.com/ Chrome but Safe
cask "chatgpt"                                      # https://chatgpt.com/ OpenAI's official ChatGPT desktop app
cask "discord"                                      # https://discord.com/
cask "elgato-control-center"                        # https://www.elgato.com/ww/en/s/downloads Control your Elgato key lights
cask "elgato-stream-deck"                           # https://www.elgato.com/ww/en/s/downloads Assign keys, and then decorate and label them
cask "firefox"                                      # https://www.mozilla.org/firefox/
cask "flycut"                                       # https://github.com/TermiT/Flycut Clean and simple clipboard manager for developers
cask "font-fira-mono-nerd-font"                     # https://github.com/ryanoasis/nerd-fonts
cask "font-hack-nerd-font"                          # https://github.com/ryanoasis/nerd-fonts
cask "font-inconsolata-nerd-font"                   # https://github.com/ryanoasis/nerd-fonts
cask "font-jetbrains-mono-nerd-font"                # https://github.com/ryanoasis/nerd-fonts
cask "font-roboto-mono-nerd-font"                   # https://github.com/ryanoasis/nerd-fonts
cask "font-sauce-code-pro-nerd-font"                # https://github.com/ryanoasis/nerd-fonts
cask "google-chrome"                                # https://www.google.com/chrome/
cask "istat-menus"                                  # Not free software https://bjango.com/mac/istatmenus/
cask "jetbrains-toolbox"                            # https://www.jetbrains.com/toolbox-app
cask "karabiner-elements"                           # https://pqrs.org/osx/karabiner/ A powerful and stable keyboard customizer for macOS
cask "key-codes"                                    # https://manytricks.com/keycodes/ Display key code, unicode value and modifier keys state for any key combination
cask "logitech-camera-settings"                     # https://support.logi.com/hc/en-us/articles/360049055854
cask "logitech-g-hub"                               # https://www.logitechg.com/en-us/innovation/g-hub.html Support for Logitech G gear
cask "mas"                                          # https://github.com/mas-cli/mas Mac App Store command-line interface
cask "mullvadvpn"                                   # https://mullvad.net/ VPN client
cask "obsidian"                                     # https://obsidian.md/ Knowledge base that works on top of a local folder of plain text Markdown files
cask "orbstack"                                     # https://orbstack.dev/ Replacement for Docker Desktop
cask "postman"                                      # https://www.getpostman.com/ Amazing API GUI
cask "qbittorrent"                                  # https://www.qbittorrent.org/ Peer to peer Bitorrent client
cask "raycast"                                      # https://raycast.app/ Better spotlight
cask "rectangle"                                    # https://rectangleapp.com/ Window control with simple keyboard shortcuts
cask "session-manager-plugin"                       # https://docs.aws.amazon.com/systems-manager/latest/userguide/session-manager-working-with-install-plugin.html
cask "signal"                                       # https://signal.org/
cask "slack"                                        # https://slack.com/
cask "spotify"                                      # https://www.spotify.com/
cask "visual-studio-code"                           # https://code.visualstudio.com/ Code editing redefined
cask "wireguard-go"                                 # https://www.wireguard.com/ Userspace Go implementation of WireGuard
cask "zoom"                                         # https://www.zoom.us/
