#
# Brew Taps (see formulae below)
#
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

#
# Libraries and Core-Utilities
#
brew "boost"                                        # https://www.boost.org/ Collection of portable C++ source libraries
brew "cmake"                                        # https://www.cmake.org/ Cross-platform make
brew "coreutils"                                    # https://www.gnu.org/software/coreutils GNU File, Shell, and Text utilities
brew "findutils"                                    # https://www.gnu.org/software/findutils GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "fontconfig"                                   # https://wiki.freedesktop.org/www/Software/fontconfig/ XML-based font configuration API for X Windows
brew "gawk"                                         # GNU awk utility
brew "gnu-sed"                                      # GNU sed (replaces off-brand macos, e.g. "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file")
brew "gnupg"                                        # https://gnupg.org/ GNU Privacy Guard
brew "grep"                                         # GNU grep (replaces off-brand macos)
brew "libmagic"                                     # https://www.darwinsys.com/file/ Implementation of the file(1) command - required for python mime detection
brew "libsodium"                                    # https://github.com/jedisct1/libsodium/ A modern, portable, easy to use crypto library
brew "lz4"                                          # https://lz4.org Lossless compression utility, similar to zip
brew "moreutils"                                    # https://joeyh.name/code/moreutils/ Install some other useful utilities like `sponge`
brew "nghttp2"                                      # https://github.com/nghttp2/nghttp2 HTTP/2 C Library and tools
brew "openssl"                                      # https://openssl.org/ Cryptography and SSL/TLS Toolkit
brew "readline"                                     # ensure gawk and others... get up-to-date readline
brew "screen"                                       # https://www.gnu.org/software/screen GNU Screen
brew "wget"                                         # https://www.gnu.org/software/wget/ GNU wget
brew "xz"                                           # https://tukaani.org/xz/ General-purpose data compression with high compression ratio

#
# Languages and Platforms
#
brew "go"                                           # (Backup, primary managed by asdf) https://golang.org The GO Programming language
brew "python"                                       # (Backup, primary managed by asdf) https://www.python.org/ Latest python (>3.7)

#
# Brew Formulae
#
brew "awscli"                                       # https://aws.amazon.com/cli/ Official Amazon AWS command-line interface
brew "bash"                                         # https://www.gnu.org/software/bash/ Bourne-Again SHell, a UNIX command interpreter
brew "bat"                                          # https://github.com/sharkdp/bat Clone of cat(1) with syntax highlighting and Git integration
brew "brew-cask-completion"                         # https://github.com/xyb/homebrew-cask-completion Fish/zsh completion for brew-cask
brew "btop"                                         # https://github.com/aristocratos/btop Resource monitor. C++ version and continuation of bashtop and bpytop
brew "caarlos0/tap/svu"                             # https://github.com/caarlos0/svu Semantic Version Utility
brew "chezmoi"                                      # https://chezmoi.io/ Manage your dotfiles across multiple diverse machines, securely
brew "docker-credential-helper-ecr"                 # https://github.com/awslabs/amazon-ecr-credential-helper Docker Credential Helper for Amazon ECR
brew "dos2unix"                                     # https://waterlan.home.xs4all.nl/dos2unix.html Convert text between DOS, UNIX, and Mac formats
brew "fzf"                                          # https://github.com/junegunn/fzf A command-line fuzzy finder
brew "git"                                          # https://git-scm.com Distributed revision control system
brew "htop"                                         # https://hisham.hm/htop/ Improved top
brew "jq"                                           # https://stedolan.github.io/jq/ Awesome JSON command line utility
brew "lsd"                                          # https://github.com/Peltoche/lsd The next gen ls command
brew "ncdu"                                         # https://dev.yorhel.nl/ncdu NCurses Disk Usage
brew "nethogs"                                      # https://raboof.github.io/nethogs/ Net top tool grouping bandwidth per process
brew "nmap"                                         # https://nmap.org/ Port scanning utility for large networks
brew "mise"                                         # https://mise.jdx.dev/ Polyglot runtime manager (asdf rust clone)
brew "python-yq"                                    # https://yq.readthedocs.io/ JQ for YAML and XML
brew "reattach-to-user-namespace"                   # https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard Notes and workarounds for accessing the Mac OS X pasteboard in tmux sessions
brew "ripgrep"                                      # https://github.com/BurntSushi/ripgrep Search tool like grep and The Silver Searcher
brew "schappim/ocr/ocr"                             # https://github.com/schappim/macOCR Get any text on your screen into your clipboard.
brew "starship"                                     # https://starship.rs Cross-shell prompt for astronauts
brew "tig"                                          # https://jonas.github.io/tig/ Text interface for Git repositories
brew "tldr"                                         # https://tldr.sh/ Simplified and community-driven man pages
brew "tmux"                                         # https://tmux.github.io/ Terminal multiplexer
brew "tree"                                         # http://mama.indstate.edu/users/ice/tree/ Display directories as trees (with optional color/HTML output)
brew "vim"                                          # https://www.vim.org/ Up-to-date vim replacement
brew "watch"                                        # https://gitlab.com/procps-ng/procps Executes a program periodically, showing output fullscreen
brew "xh"                                           # https://github.com/ducaale/xh Modern cURL + features
brew "zsh"                                          # https://www.zsh.org/ UNIX shell (command interpreter)

#
# Brew Casks
#
cask "alacritty"                                    # https://github.com/alacritty/alacritty/ GPU-accelerated terminal emulator
cask "aerial"                                       # https://github.com/JohnCoates/Aerial Pretty screen-savers
cask "bartender"                                    # Not free software https://www.macbartender.com/
cask "bitwarden"                                    # https://bitwarden.com/ The definitive best personal credential manager
cask "brave-browser"                                # https://brave.com/ Chrome but Safe
cask "discord"                                      # https://discord.com/
cask "orbstack"                                     # https://orbstack.dev/ Replacement for Docker Desktop
cask "firefox"                                      # https://www.mozilla.org/firefox/
cask "flycut"                                       # https://github.com/TermiT/Flycut Clean and simple clipboard manager for developers
cask "font-fira-mono-nerd-font"                     #
cask "font-hack-nerd-font"                          #
cask "font-inconsolata-nerd-font"                   #
cask "font-jetbrains-mono-nerd-font"                #
cask "font-roboto-mono-nerd-font"                   #
cask "font-sauce-code-pro-nerd-font"                #
cask "google-chrome"                                # https://www.google.com/chrome/
cask "istat-menus"                                  # Not free software https://bjango.com/mac/istatmenus/
cask "jetbrains-toolbox"                            # https://www.jetbrains.com/toolbox-app
cask "karabiner-elements"                           # https://pqrs.org/osx/karabiner/ A powerful and stable keyboard customizer for macOS
cask "logitech-camera-settings"                     # https://support.logi.com/hc/en-us/articles/360049055854
cask "postman"                                      # https://www.getpostman.com/ Amazing API GUI
cask "qlcolorcode"                                  # https://github.com/anthonygelibert/QLColorCode QuickLook for code
cask "qlimagesize"                                  # https://github.com/Nyx0uf/qlImageSize QuickLook image info
cask "qlmarkdown"                                   # https://github.com/toland/qlmarkdown QuickLook generator for Markdown files
cask "qlprettypatch"                                # https://github.com/atnan/QLPrettyPatch QuickLook generator for patch files
cask "qlstephen"                                    # https://whomwah.github.io/qlstephen/ QuickLook plugin for plain text files sans file extension
cask "quicklook-csv"                                # https://github.com/p2/quicklook-csv
cask "quicklook-json"                               # http://www.sagtau.com/quicklookjson.html
cask "qbittorrent"                                  # https://www.qbittorrent.org/ Peer to peer Bitorrent client
cask "raycast"                                      # https://raycast.app/ Better spotlight
cask "rectangle"                                    # https://rectangleapp.com/ Window control with simple keyboard shortcuts
cask "session-manager-plugin"                       # https://docs.aws.amazon.com/systems-manager/latest/userguide/session-manager-working-with-install-plugin.html
cask "signal"                                       # https://signal.org/
cask "slack"                                        # https://slack.com/
cask "spotify"                                      # https://www.spotify.com/
cask "visual-studio-code"                           # https://code.visualstudio.com/ Code editing redefined
cask "webpquicklook"                                # https://github.com/emin/WebPQuickLook QuickLook plugin for WebP image files
cask "wireguard-go"                                 # https://www.wireguard.com/ Userspace Go implementation of WireGuard
cask "zoom"                                         # https://www.zoom.us/
