# Brew Taps (see formulae below)
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Brew Proto Formulae
brew "fontconfig"                                   # https://wiki.freedesktop.org/www/Software/fontconfig/ XML-based font configuration API for X Windows
brew "openssl"
brew "readline"                                     # ensure gawk and others... get up-to-date readline
brew "xz"

# Brew Formulae
brew "asdf"                                         # https://asdf-vm.com/#/ Manage multiple runtime versions with a single CLI tool
brew "ansible"                                      # https://www.ansible.com/ Automate deployment, configuration, and upgrading
# brew "autojump"                                     # https://github.com/wting/autojump A cd command that learns
brew "awscli"                                       # https://aws.amazon.com/cli/ Official Amazon AWS command-line interface
brew "bat"                                          # https://github.com/sharkdp/bat Alternative to `cat` with syntax highlighting
brew "bash"
brew "boost"                                        # https://www.boost.org/ Collection of portable C++ source libraries
brew "brew-cask-completion"                         # https://github.com/xyb/homebrew-cask-completion Fish/zsh completion for brew-cask
brew "brotli"                                       # https://github.com/google/brotli Generic-purpose lossless compression algorithm by Google
brew "capnp"                                        # https://capnproto.org/ Data interchange format and capability-based RPC system
brew "cmake"                                        # https://www.cmake.org/ Cross-platform make
# brew "cookiecutter"                                 # https://github.com/audreyr/cookiecutter Utility that creates projects from templates
brew "coreutils"                                    # https://www.gnu.org/software/coreutils GNU File, Shell, and Text utilities
brew "docker-credential-helper-ecr"                 # https://github.com/awslabs/amazon-ecr-credential-helper Docker Credential Helper for Amazon ECR
brew "dos2unix"                                     # https://waterlan.home.xs4all.nl/dos2unix.html Convert text between DOS, UNIX, and Mac formats
brew "erlang"                                       # https://www.erlang.org/ Programming language for highly scalable real-time systems
brew "elixir"                                       # https://elixir-lang.org/ Functional metaprogramming aware language built on Erlang VM
brew "findutils"                                    # GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed
brew "fzf"                                          # https://github.com/junegunn/fzf A command-line fuzzy finder
brew "gawk"                                         # GNU awk utility
brew "git"                                          # https://git-scm.com Distributed revision control system
brew "gnu-sed"                                      # GNU sed (replaces off-brand macos, e.g. "sed -i 's/foo/bar/' file" instead of "sed -i '' 's/foo/bar/' file")
brew "gnupg"                                        # https://gnupg.org/ GNU Privacy Guard
brew "go"                                           # (Backup, primary managed by asdf) https://golang.org The GO Programming language
brew "grep"                                         # GNU grep (replaces off-brand macos)
brew "gti"                                          # http://r-wos.org/hacks/gti Humorous git alias
brew "htop"                                         # https://hisham.hm/htop/ Improved top
brew "httpie"                                       # https://github.com/jkbrzt/httpie Modern CURL + features
brew "jq"                                           # https://stedolan.github.io/jq/ Awesome JSON command line utility
brew "libmagic"                                     # https://www.darwinsys.com/file/ Implementation of the file(1) command - required for python mime detection
brew "libsodium"                                    # https://github.com/jedisct1/libsodium/ A modern, portable, easy to use crypto library
brew "lsd"                                          # https://github.com/Peltoche/lsd The next gen ls command
brew "lz4"                                          # https://lz4.org Lossless compression utility, similar to zip
brew "moreutils"                                    # https://joeyh.name/code/moreutils/ Install some other useful utilities like `sponge`
# brew "mysql-client"                                 # https://dev.mysql.com/doc/refman/5.7/en/ Open source relational database management system
brew "ncdu"                                         # https://dev.yorhel.nl/ncdu NCurses Disk Usage
brew "nethogs"                                      # https://raboof.github.io/nethogs/ Net top tool grouping bandwidth per process
brew "nghttp2"                                      # https://github.com/nghttp2/nghttp2 HTTP/2 C Library and tools
brew "nmap"                                         # https://nmap.org/ Port scanning utility for large networks
brew "octave"                                       # https://www.gnu.org/software/octave/index.html High-level interpreted language for numerical computing
brew "postgresql"                                   # https://www.postgresql.org/ Object-relational database system
brew "protobuf"                                     # https://github.com/protocolbuffers/protobuf/ Protocol buffers (Google's data interchange format)
brew "python"                                       # (Backup, primary managed by asdf) https://www.python.org/ Latest python (>3.7)
brew "python-yq"                                    # https://yq.readthedocs.io/ JQ for YAML and XML
brew "reattach-to-user-namespace"                   # https://github.com/ChrisJohnsen/tmux-MacOSX-pasteboard Notes and workarounds for accessing the Mac OS X pasteboard in tmux sessions
brew "redis"                                        # https://redis.io/ Persistent key-value database, with built-in net interface
brew "ripgrep"                                      # https://github.com/BurntSushi/ripgrep Search tool like grep and The Silver Searcher
brew "screen"                                       # https://www.gnu.org/software/screen GNU Screen
brew "speedtest-cli"                                # https://github.com/sivel/speedtest-cli Command-line interface for https://speedtest.net bandwidth tests
brew "terraform"                                    # (Backup, primary managed by asdf) https://www.terraform.io/ Tool to build, change, and version infrastructure
brew "tig"                                          # https://jonas.github.io/tig/ Text interface for Git repositories
brew "tldr"                                         # https://tldr.sh/ Simplified and community-driven man pages
brew "tmux"                                         # https://tmux.github.io/ Terminal multiplexer
brew "trash"                                        # https://tmux.github.io/ Terminal multiplexer
brew "tree"                                         # http://mama.indstate.edu/users/ice/tree/ Display directories as trees (with optional color/HTML output)
brew "vim"                                          # https://www.vim.org/ Up-to-date vim replacement
brew "watch"                                        # https://gitlab.com/procps-ng/procps Executes a program periodically, showing output fullscreen 
brew "watchman"                                     # https://github.com/facebook/watchman Watch files and take action when they change 
brew "wget"                                         # https://www.gnu.org/software/wget/ GNU wget
brew "yarn"                                         # https://yarnpkg.com/ JavaScript package manager
brew "zsh"
# brew "zplug"                                        # https://github.com/zplug/zplug
# brew "zsh-autosuggestions"                          # https://github.com/zsh-users/zsh-autosuggestions Fish-like fast/unobtrusive autosuggestions for zsh
# brew "zsh-syntax-highlighting"                      # https://github.com/zsh-users/zsh-syntax-highlighting Fish shell like syntax highlighting for zsh

# Brew Casks
# cask "aerial"                                       # https://github.com/JohnCoates/Aerial Pretty screen-savers
cask "alfred"                                       # https://www.alfredapp.com/ Spot-Light Replacement
cask "android-file-transfer"                        # https://www.android.com/filetransfer/ Browse and transfer files between your Mac computer and your Android device.
cask "bartender"                                    # Not free software https://www.macbartender.com/
# cask "battle-net"                                   # For the Horde!
cask "dash"                                         # https://kapeli.com/dash API Documentation Browser and Code Snippet Manager.
cask "docker"                                       # https://www.docker.com/community-edition docker for mac
cask "firefox"                                      # https://www.mozilla.org/firefox/
cask "flycut"                                       # https://github.com/TermiT/Flycut Clean and simple clipboard manager for developers
cask "font-awesome-terminal-fonts"                  # 
cask "font-fontawesome"                             # 
cask "font-hack"                                    # 
cask "font-inconsolata-dz-for-powerline"            # 
cask "font-inconsolata-for-powerline"               # 
cask "font-inconsolata-g-for-powerline"             # 
cask "font-roboto-mono"                             # 
cask "font-roboto-mono-for-powerline"               # 
cask "font-source-code-pro"                         # 
cask "font-source-code-pro-for-powerline"           # 
cask "google-chrome"                                # https://www.google.com/chrome/
cask "jetbrains-toolbox"                            # https://www.jetbrains.com/toolbox-app
cask "istat-menus"                                  # Not free software https://bjango.com/mac/istatmenus/
cask "karabiner-elements"                           # https://pqrs.org/osx/karabiner/ A powerful and stable keyboard customizer for macOS
cask "kitty"                                        # https://github.com/kovidgoyal/kitty A cross-platform, fast, feature full, GPU based terminal emulator
cask "macs-fan-control"                             # https://www.crystalidea.com/macs-fan-control Control fans on Apple computers
cask "postman"                                      # https://www.getpostman.com/ Amazing API GUI
cask "qlcolorcode"                                  # https://github.com/anthonygelibert/QLColorCode QuickLook for code
cask "qlimagesize"                                  # https://github.com/Nyx0uf/qlImageSize QuickLook image info
cask "qlmarkdown"                                   # https://github.com/toland/qlmarkdown QuickLook generator for Markdown files
cask "qlprettypatch"                                # https://github.com/atnan/QLPrettyPatch QuickLook generator for patch files
cask "qlstephen"                                    # https://whomwah.github.io/qlstephen/ QuickLook plugin for plain text files sans file extension
cask "quicklook-csv"                                # https://github.com/p2/quicklook-csv
cask "quicklook-json"                               # http://www.sagtau.com/quicklookjson.html
# cask "robo-3t"                                      # https://robomongo.org/ Lightweight GUI for MongoDB 
cask "spectacle"                                    # https://www.spectacleapp.com/ Window control with simple keyboard shortcuts
cask "slack"
cask "spotify"
# cask "steam"
# cask "the-unarchiver"                               # https://theunarchiver.com/ Nice file archive GUI
cask "tunnelblick"                                  # https://www.tunnelblick.net/ OpenVPN client on macOS
cask "visual-studio-code"                           # https://code.visualstudio.com/ Code editing redefined
cask "vlc"                                          # https://www.videolan.org/vlc/ VLC is a free and open source cross-platform multimedia player 
cask "webpquicklook"                                # https://github.com/emin/WebPQuickLook QuickLook plugin for WebP image files
